InformationRegisters/НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохраняемоеЗначениеПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. ДанныеАвторизацииСлужебный
//
Функция ДанныеАвторизации() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ДанныеАвторизацииСлужебный();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные авторизации служебным пользователем для загрузки кандидатов из Интернета.
// 
// Возвращаемое значение:
//  Неопределено, Структура - Данные авторизации:
// * Пользователь - СправочникСсылка.Пользователи - служебный пользователь, от имени которого будет работать загрузка,
// * Пароль - Строка - пароль служебного пользователя
//
Функция ДанныеАвторизацииСлужебный()

	Данные = Новый Структура();
	Данные.Вставить("ИмяПользователя", "");
	Данные.Вставить("Пароль", "");

	Настройки = ПрочитатьНастройки();
	Если Настройки = Неопределено Тогда
		// Создать пользователя.
		СоздатьОбновитьПользователя(Справочники.Пользователи.СоздатьЭлемент());
		// Прочитать пароль и настройки.
		Настройки = ПрочитатьНастройки();
		// Пароль и настройки можно не проверять, т.к. созданы они были только что.
		Данные.ИмяПользователя = Настройки.ИмяПользователя;
		Данные.Пароль = ПрочитатьПароль(Настройки.Пользователь);
		Возврат Данные;
	КонецЕсли;

	// Проверить настройки,
	// если пароль не совпадает - обновить пароль.
	ПользовательОбъект = Настройки.Пользователь.ПолучитьОбъект();
	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(ПользовательОбъект.ИдентификаторПользователяИБ);
	
	Если СвойстваПользователяИБ.Имя = Настройки.ИмяПользователя 
		И СвойстваПользователяИБ.СохраняемоеЗначениеПароля = Настройки.СохраняемоеЗначениеПароля Тогда
		Данные.ИмяПользователя = Настройки.ИмяПользователя;
		Данные.Пароль = ПрочитатьПароль(Настройки.Пользователь);
		Возврат Данные;
	КонецЕсли;
	
	Пароль = ПрочитатьПароль(Настройки.Пользователь);

	// Если кто-то по какой-то причине изменил имя пользователя или пароль, то их нужно принудительно восстановить.
	СоздатьОбновитьПользователя(ПользовательОбъект, Пароль);

	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(ПользовательОбъект.ИдентификаторПользователяИБ);

	Данные.ИмяПользователя = СвойстваПользователяИБ.Имя;
	Данные.Пароль = Пароль;
	Возврат Данные;
	
КонецФункции

// Создать или обновить пользователя.
// 
// Параметры:
//  ПользовательОбъект - СправочникОбъект.Пользователи
//  Пароль - Неопределено, Строка - 
//
Процедура СоздатьОбновитьПользователя(ПользовательОбъект, Пароль = Неопределено)
	
	// Создать (или обновить) пользователя, установить пароль.
	ОписаниеПользователяИБ = Новый Структура();
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("Имя", "hs-applicants");
	ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
	ОписаниеПользователяИБ.Вставить("АутентификацияОС", Ложь);
	ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", Ложь);
	ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Ложь);
	Если Пароль = Неопределено Тогда
		ОписаниеПользователяИБ.Вставить("Пароль", Пользователи.СоздатьПароль(32, Истина));
	Иначе
		ОписаниеПользователяИБ.Вставить("Пароль", Пароль);
	КонецЕсли;
	ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", Истина);
	ОписаниеПользователяИБ.Вставить("Роли",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.Роли.ИспользованиеЗагрузкиКандидатовИзИнтернета.Имя));
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета.ПолноеИмя());
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		// Создаем пользователя.
		ПользовательОбъект.Наименование = НСтр("ru = 'HTTP-сервис загрузки кандидатов из Интернета'");
		ПользовательОбъект.Служебный = Истина;
		ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		ПользовательОбъект.Записать();
		РезультатДействия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ПользовательОбъект.ДополнительныеСвойства, "ОписаниеПользователяИБ", Новый Структура()),
			"РезультатДействия", ""); // Строка
		// Получаем свойства созданного пользователя.
		СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(ПользовательОбъект.ИдентификаторПользователяИБ);
		// Записываем его свойства в регистр для последующего контроля.
		Настройки = НастройкиДоступа();
		Настройки.Пользователь = ПользовательОбъект.Ссылка;
		Настройки.ИмяПользователя = СвойстваПользователяИБ.Имя;
		Настройки.СохраняемоеЗначениеПароля = СвойстваПользователяИБ.СохраняемоеЗначениеПароля;
		ЗаписатьНастройки(Настройки);
		// Пароль записываем отдельно, в безопасное хранилище.
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПользовательОбъект.Ссылка, 
			ОписаниеПользователяИБ.Пароль, "Пароль");
		// Фиксируем информацию в журнале.
		ЗаписатьВЖурналПользовательУспешноОбновлен(ОписаниеПользователяИБ, РезультатДействия);
		ЗафиксироватьТранзакцию();
	Исключение
		ЗаписатьВЖурналОшибкаОбновленияПользователя(ОписаниеПользователяИБ);
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция НастройкиДоступа()
	Настройки = Новый Структура();
	Настройки.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	Настройки.Вставить("ИмяПользователя", "");
	Настройки.Вставить("СохраняемоеЗначениеПароля", "");
	Возврат Настройки;
КонецФункции

// Записывает содержимое регистра.
// 
// Параметры:
//  Настройки - Структура - НастройкиДоступа()
Процедура ЗаписатьНастройки(Настройки)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Читает сохраненные в регистре настройки.
// 
// Возвращаемое значение:
//  Неопределено, ФиксированнаяСтруктура - Прочитать настройки:
// * СохраняемоеЗначениеПароля - Строка -
// * Пользователь - СправочникСсылка.Пользователи -
// * ИмяПользователя - Строка -
//
Функция ПрочитатьНастройки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки.Пользователь КАК Пользователь,
		|	Настройки.ИмяПользователя КАК ИмяПользователя,
		|	Настройки.СохраняемоеЗначениеПароля КАК СохраняемоеЗначениеПароля
		|ИЗ
		|	РегистрСведений.НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета КАК Настройки
		|ГДЕ
		|	Настройки.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Настройки = НастройкиДоступа();
	ЗаполнитьЗначенияСвойств(Настройки, Выборка);

	Возврат ОбщегоНазначения.ФиксированныеДанные(Настройки);
	
КонецФункции

// Прочитать сохраненный пароль.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Строка, Неопределено -
//
Функция ПрочитатьПароль(Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "Пароль"); // Строка
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пароль;

КонецФункции

// Записать в журнал успешное создание (или обновление) пользователя.
// 
// Параметры:
//  ОписаниеПользователяИБ - Структура - Пользователи.НовоеОписаниеПользователяИБ
//
Процедура ЗаписатьВЖурналПользовательУспешноОбновлен(ОписаниеПользователяИБ, РезультатДействия)
	
	СведенияОПользователе = ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеПользователяИБ);
	СведенияОПользователе.Удалить("Пароль");
	СведенияОПользователе.Удалить("ПользовательИБ");

	Комментарий = СтрШаблон(
		НСтр("ru = 'Выполнена запись пользователя для HTTP-сервиса загрузки кандидатов из Интернета.
			|
			|Описание пользователя ИБ:
			|-------------------------------------------
			|%1
			|-------------------------------------------
			|
			|Результат:
			|-------------------------------------------
			|%2
			|-------------------------------------------'"),
		ОбщегоНазначения.ЗначениеВСтрокуXML(СведенияОПользователе),
		РезультатДействия);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Загрузка кандидатов из Интернета.Запись пользователя'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.Пользователи, ,
		Комментарий);
	
КонецПроцедуры

// Записать в журнал ошибку создания (или обновления) пользователя.
// 
// Параметры:
//  ОписаниеПользователяИБ - Структура - Пользователи.НовоеОписаниеПользователяИБ
//
Процедура ЗаписатьВЖурналОшибкаОбновленияПользователя(ОписаниеПользователяИБ)
	
	СведенияОПользователе = ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеПользователяИБ);
	СведенияОПользователе.Удалить("Пароль");
	
	Комментарий = СтрШаблон(
		НСтр("ru = 'При записи пользователя для HTTP-сервиса загрузки кандидатов из Интернета.
			|
			|Описание пользователя ИБ:
			|-------------------------------------------
			|%1
			|-------------------------------------------
			|
			|Текст ошибки:
			|-------------------------------------------
			|%2
			|-------------------------------------------'"),
		ОбщегоНазначения.ЗначениеВСтрокуXML(СведенияОПользователе),
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Загрузка кандидатов из Интернета.Запись пользователя'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.Пользователи, ,
		Комментарий);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
